___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [5]:
sal['BasePay'].mean()

66325.448840487705

** What is the highest amount of OvertimePay in the dataset ? **

In [6]:
sal['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [7]:
#method 1 
for i in range(len(sal['EmployeeName'])):
    if sal['EmployeeName'][i] == 'JOSEPH DRISCOLL':
        print(i, sal['JobTitle'][i])

24 CAPTAIN, FIRE SUPPRESSION

In [8]:
#method 2
sal_byname = sal.set_index('EmployeeName') #make temperary DataFrame

In [9]:
sal_byname.loc['JOSEPH DRISCOLL','JobTitle']

'CAPTAIN, FIRE SUPPRESSION'

In [10]:
#solution~method 3
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [11]:
#sal_byname.loc['JOSEPH DRISCOLL',['Benefits','TotalPay','TotalPayBenefits']]
sal_byname.loc['JOSEPH DRISCOLL',['TotalPayBenefits']]

TotalPayBenefits    270325
Name: JOSEPH DRISCOLL, dtype: object

** What is the name of highest paid person (including benefits)?**

In [12]:
sal_bypay = sal.set_index('TotalPayBenefits')
sal_bypay.loc[sal['TotalPayBenefits'].max()]

Id                                                           1
EmployeeName                                    NATHANIEL FORD
JobTitle        GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                 167411
OvertimePay                                                  0
OtherPay                                                400184
Benefits                                                   NaN
TotalPay                                                567595
Year                                                      2011
Notes                                                      NaN
Agency                                           San Francisco
Status                                                     NaN
Name: 567595.43, dtype: object

In [13]:
#solution
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]
# or
# sal.loc[sal['TotalPayBenefits'].idxmax()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [14]:
sal_bypay.loc[sal['TotalPayBenefits'].min()]
#He got 0 Pay and was acually charged $618.13 in the catergory of 'OtherPay'

Id                                  148654
EmployeeName                     Joe Lopez
JobTitle        Counselor, Log Cabin Ranch
BasePay                                  0
OvertimePay                              0
OtherPay                           -618.13
Benefits                                 0
TotalPay                           -618.13
Year                                  2014
Notes                                  NaN
Agency                       San Francisco
Status                                 NaN
Name: -618.13, dtype: object

In [15]:
#solution
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].min()] #['EmployeeName']
# or
#sal.loc[sal['TotalPayBenefits'].idxmin()] #Series.idxmin() return the index of maximun value

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [16]:
import numpy as np
sal_pivot1 = sal.pivot_table(values='BasePay',index='Year',aggfunc=np.mean)
sal_pivot1

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

In [17]:
#solution
sal.groupby('Year').mean()['BasePay'] # here the .mean() just calculte the numerical columns

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [18]:
sal['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

In [19]:
sal['JobTitle'].value_counts().sort_values(ascending=False).head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [20]:
sal_byyear = sal.set_index('Year')
df = sal_byyear.loc[2013]['JobTitle'].value_counts(ascending=True)
#sal['Year'].value_counts(bins=2) #see usage of arg 'bins'
df.value_counts()[1] #series element can always be count

202

In [21]:
#improve the solution based on answers 
sal[sal['Year']==2013]['JobTitle'].value_counts().value_counts()[1]

202

In [22]:
#solution
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1) #this saves operation times

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [23]:
#copy from the solution
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else: 
        return False

In [24]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))
#len(sal[sal['JobTitle'].apply(lambda x: chief_string(x))])

627

In [25]:
# announcement from instructor : fail to consider cases like'Chief, Justice'
# waht's more, unique names to be counted is better
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else: 
        return False
#to deal with the uniqueness
sum(sal[~sal['EmployeeName'].duplicated()]['JobTitle'].apply(lambda x: chief_string(x)))

487

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [26]:
#taking advice from the solution
sal['Title_length'] = sal['JobTitle'].apply(lambda x: len(x))
sal[['Title_length','TotalPayBenefits']].corr()

                  Title_length  TotalPayBenefits
Title_length          1.000000         -0.036878
TotalPayBenefits     -0.036878          1.000000

## Other test and comments

#### reduce the redundant data using .index.dupicated()

In [27]:
#len(sal)-len(sal[~sal.index.duplicated('first')]) #0
len(sal)-len(sal_byyear[~sal_byyear.index.duplicated('first')])#148654-4
#len(sal)-len(sal_byyear) #0

148650

#### test the use of DataFrame.idxmax() or DataFrame.idxmin()

In [28]:
A={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
df_A = pd.DataFrame(A)
print(df_A.idxmax(axis = 0))
print('\n')
print(df_A.idxmax(axis = 1))#this DataFrame just returns the index of maximum value of each column or row

a    2
b    2
c    2
dtype: int64


0    c
1    c
2    c
dtype: object

In [46]:
#sal.drop_duplicates(['Year','EmployeeName']) # how to drop duplicates data

# Great Job!